{
	"cavan": {
		"link": "https://www.carhire.ie/cavanbackground.php",
		"text": "Cavan comes from the old Irish word for ‘hollow’ or ‘little hill’, and all it takes is a few minutes driving in the countryside to understand how the name was attached to this place. It’s a land of drumlins, small-scale hills and ridges that alternate with a spectacular network of wooded lakes. This is ideal country for walking, angling or simply enjoying the outdoors. In the ancient days of Gaelic Ireland, Cavan was part of the Bréifne kingdom, and it remained under the jurisdiction of the O’Reilly clan. This was long before anything resembling the modern-day town was in place. The O’Reillys built a castle in the 1200s, along with St Mary’s Abbey. The bell tower of the Abbey remains an iconic fixture of Cavan to this day, though the rest of the structure was lost. However, the stones of the friary were used to build many historic buildings that are still standing in Cavan. The O’Reilly clan maintained its grip on Cavan until the 1400s, when the Nine Years War saw English troops battling Irish clans for control of the countryside. The clans lost control of the region, and the English brought in Protestant settlers from Scotland to wrest power from those loyal to the Catholic church. This led to further uprisings and rebellions that would continue for centuries through to the War for Irish Independence. Today, Cavan is a hidden gem that many visitors are completely unaware of. Less than a 90 minute drive from Dublin, Cavan is an ideal weekend destination. That said, many visitors leave wishing they had scheduled more time in Ireland’s Lake Lands – especially during the summer months."
	},
	"monaghan": {
		"link": "https://www.monaghantourism.com/index.php/about-county-monaghan",
		"text": "County Monaghan takes its name from the Irish ‘Muineacháin’, meaning ‘little hills’. Inhabited from an early era, many relics of the Bronze Age have been unearthed throughout the county over the years. It was later the centre and heartland of the kingdom of Oriel, and an ancient monument at Donaghmoyne is reputed to have been the residence of the Kings of Oriel. The arrival of Christianity saw St. Patrick visit several locations in the county, while his ‘right-hand man’ – St. Macartan became patron of the diocese of which County Monaghan forms approximately one half.  Tiernach of Clones and Dympna of Tydavnet later became two of Ireland’s best known saints. The Vikings were invaders during the 10-11th centuries and a Viking fort is still visible near Glaslough, while a later Norman motte and bailey stands at Donaghmoyne.  Prior to the 17th century Plantation's County Monaghan was ruled by the McMahons who controlled four fifths of its area, and the McKennas who controlled the remaining one fifth. When the Elizabethans decided in 1585 to divide Ulster into ‘shire-land’, the boundaries of the county were laid out, roughly the same as todays, but it was not until the first decade of the 17th century that the county was officially formed and named. From the 15th to 17th centuries the McMahons and the McKennas formed part of the armies of the O’Neills and were a constant thorn in the side of the English, whose territory ‘The Pale’, just touched the southern end of the present county. In the Nine Years War (1595-1603) the first major battle was fought at Clontibret while the McMahon/McKenna combination also figured in later battles and in the defeat at Kinsale in 1601. Mountjoy’s forces pursued them following that defeat and destroyed many of their fortifications. Elections were always keenly contested in the county, none more so than in 1826 when, on the instigation of Daniel O’Connell, Westenra was elected by the Catholic voters as a pro-Emancipation candidate and again in 1833 when Parnell addressed huge meetings at Castleblayney, Monaghan, Emyvale and Scotstown in support of Tim Healy, who then became the first ever nationalist MP for the county. The Monaghan of today is a county with strong links to its historical past and many towns and villages retain and portray a history and tradition of times long past. There are heritage trails in Monaghan, Clones and Carrickmacross and many sites of historical interest including Edergole Court Tomb, Mannan Castle Motte and Bailey, Inniskeen Round Tower and Lisnadarragh Wedge Tomb."
	},
	"louth": {
		"link": "http://www.irishabroad.com/travel/ireland/midlands/louth/",
		"text": "Situated half way between the two biggest cities in Ireland, Belfast and Dublin, lies the smallest county in Ireland, Louth. The 'Wee County' as it is affectionately known to the Irish is beautifully situated on the North East coats of the island with its long, beautiful beaches stretching away from the towering Mountains of Mourne to the North. Carlingford Lough is one of Ireland's most famous lakes with breathtaking scenery stretching even to the Isle of Man across the Irish Sea. The rugged mountains that tower over the town provide splendid country for hill walking and cater to those in search of the perfect view. Nearby, situated along the Lough is the Tain Holiday Village a 10-acre site with all sorts of water and adventure activities for the whole family and a wide choice of accommodation. From Carlingford one can strike out along the 40 km Tain Way bringing the visitor though the wild and romantic Cooley Peninsula. But if shopping or something more relaxing is what you're after Louth's two biggest towns, Drogheda and Dundalk can see to your needs. One of Ireland's oldest ands most historical towns Drogheda traces its history back to 1194. Drogheda is associated with an extraordinary number of significant events in the history of Ireland - The Battle of the Boyne, St Oliver Plunkett, Poynings Law, Cromwell's Siege and the surrender of the Irish Chieftains to the English King. These days though the town is far more relaxed and the pleasant streets of Drogheda are home to many fine bars and restaurants. Ardee and Dundalk provide alternative bases from which to explore the county but whichever one a guest choose he or she can be assured of a warm reception. Louth's unique situation between the two biggest cities in Ireland has bred a tradition of hospitality into the very ground. The war and friendly atmosphere will be unmistakable wherever you go in the county. With its mix of the modern and the mythic, the urban and the unusual Louth becomes more and more attractive to visitors with each passing year. Convenient to the big cities and with accommodation to suit every budget a visit is highly recommended."
	},
	"meath": {
		"link": "https://www.tripsavvy.com/county-meath-and-newgrange-1542094",
		"text": "The Irish name of County Meath is Contae na Mhí, the literal (and rather unexciting) meaning being 'The Middle'. Together with County Westmeath, County Meath once formed the 'Fifth Province of Ireland, the one politically in the middle of things. Cars registered in County Meath will have the letters MH on their number plates. The county town is Navan, other important towns include Ashbourne, Dunboyne, Dunshaughlin, Kells, Oldcastle, and Trim. Especially those towns near to the Dublin border have grown immensely during the boom years, housing commuters more than anything else. Meath has a size of 2,338 square kilometers. According to the 2011 census, 184,135 people live here - since 1991, the population of County Meath grew by 75%, this is the highest population growth in Ireland and mainly due to Dublin 'expanding'. The most common county nickname is 'Royal Meath', after the former seat of the Irish High Kings on the Hill of Tara. With the 1690 battle site Boyne river, Meath has the most important 'pilgrimage site' for Unionists. Meath is not only the 'Royal County', but chock-a-block with historic and majestic sites. Pride of place must, however, go to Bru na Bóinne, which provides a very informative visitor center and a gateway to the passage tombs of Newgrange and Knowth. Access to both is by guided tour only and all start at the visitor center (which is well sign-posted, but actually on the other side of the river). The reconstruction of the mound at Newgrange might be debatable, but impressive it is. If you want to get away from the (in summer often) maddening crowd, make your own way to Dowth - the third major mound of the Bru na Bóinne complex, freely accessible, not restored and often left in solitary peace. Maybe second in fame only to Newgrange, the Hill of Tara is more a general feeling of antiquity than a tangible sight. When you come here, you'll see something akin to a not-very-well-kept golf course or rough-ish landscape park. Only with a guidebook and some imagination will you be able to explore the hidden wonders of this sprawling complex. The audio- visual show in the visitor center helps a lot, walking the Hill of Tara with an open mind and a bit of time will (maybe) open up its mysteries to you. Those tourists jumping from the bus, checking off their list and having a quick gander will not get the most from this site. Personally, we recommend cold, crisp winter mornings around sunrise - if you can live with the sheep droppings. Tayto Park is a 'theme park' in County Meath and geared at families with children, though the selection of animals on view makes it interesting for adults too. It is very good for a day out with the family, quite good if you visit without kids and are not on the lookout for peace and quiet. The focus is on physical activity and a learning experience, a very welcome change from passive entertainment. This is a top destination if you need to keep the kids amused in the greater Dublin area and the weather is with you."
	},
	"westmeath": {
		"link": "http://www.rootsireland.ie/about-westmeath/",
		"text": "County Westmeath is sometimes referred to as “The Lake County” due to the abundance of lakes, streams and other waterways in the county. This inland county is part of the midlands and is in the province of Leinster. County Westmeath has a long and colourful history that predates its official charter. It is said that this was the meeting place of the five ancient provinces of Ireland. Prior to the arrival of St. Patrick, the county was the gathering place for the High Kings of Ireland. The Normans arrived about 1170 and built many castles and forts. The county was officially established in 1543 and was named after the historic kingdom of Mide. The county was centrally involved in the 1641 rebellion and was active in the Williamite wars. Most of the Irish or Norman landholders lost their land following the 1641 rebellion. Throughout the county you will find remarkable evidence of the region’s long and colourful past. Uisneagh Hill is an impressive hill nearly 180 meters tall. It is here that King Tuathal Teachmar erected his palace in the early second century. For two hundred years the pagan kings of Ireland ruled. There are many castles located within the county. Perhaps the most famous is Tullynally. This castle, which is still lived in by the family of the Earl of Longford, is a beautiful castle that is nearly a quarter of a mile long. One of the oldest Castles in Westmeath is Delvin Castle, built in 1181 by Hugh De Lacy. Athlone Castle was built in 1210 for King John of England. It was strategically placed to guard one of the main crossings of the River Shannon. Crookedwood Fort is one of the oldest structures in the county. It is related to the old Stories of Fionn, the mythological hunter and warrior or the Druids. Nearby at Taughmon is a fourteenth century fortified stone church. Many of the towns located within the county have their own distinct histories. The town of Fore is a medieval town containing a large moat from Anglo-Norman times. There are remnants of the ancient city walls and a Benedictine Monastery that was in use until Henry VIII closed it in 1539. The monastery contains superior ancient artwork and crosses. The population of Westmeath in 1841 was 141,300. During the Great Famine of 1845-1847, the population decreased until it was 111,407 in 1851. The population continued to decrease to 56,818 in 1926. In 2011, the population was 86,164."
	},
	"donegal": {
		"link": "http://www.donegallanguageschool.com/glimpse-bundoran/",
		"text": "Donegal often called the “forgotten county?” is one of Ireland’s most beautiful counties. We have put together some interesting facts for anyone visiting the area. Donegal is situated in the north-west of Ireland and is surrounded by 5 counties including Sligo, Leitrim, Derry, Tyrone and Fermanagh making it a perfect platform to explore some hidden beauties. The County has six hundred and fifty kilometres of rugged coastline and sandy beaches to explore. Tory Island off of Donegal has a King. This is a unique tradition that does not exist anywhere else in Ireland. The current Rí Thoraí (Irish for King of Tory) is painter Patsaí Dan Mac Ruaidhrí (Patsy Dan Rodgers in English). The king has no formal powers; though duties include being a spokesperson for the island community and welcoming people to the island. The total population of the Island is under 200. Donegal has the second-largest Gaeltacht(where Irish is the first language) area in the whole of Ireland. Some famous people that have hailed from Donegal include the world famour singer Enya, the renowned trad group Clannad, country and western crooner Daniel O Donnnell, rock legend Rory Gallagher and for those of literary interest the poet William Allingham. All in all Donegal is a great place to visit while on holidays in Ireland."
	},
	"leitrim": {
		"link": "https://www.irishcentral.com/roots/county-leitrim-87161507-237773921",
		"text": "In ancient times Leitrim formed the western half of the Kingdom of Breifne, which from 1256 onwards was ruled over by the O’Rourke family. The O’Rourke’s heraldic symbol of the lion still has a presence in Leitrim’s official crest. Normans invaded in the 13th century and occupied the southern portion of the kingdom, though the O’Rourkes more or less maintained control through the 16th century, when modern day Leitrim was carved out of the ancient Kingdom of Breifne. The county suffered a number of rough blows in the mid-1800s. First, there was a recession caused by the mechanization of linen weaving (one of the county’s prime exports) in the 1830's. Then the Great Famine saw Leitrim's population of 155,000 (as of the 1841 census) plummet to 112,000 by 1851. In addition to the linen industry, Leitrim was also noted for its coal mining and mining of iron ore. The county’s last coal mine remained open until 1990 and now functions as a visitor center, the Arigna Mining Experience. Key attractions: Though Leitrim is the smallest of Connacht’s five counties in both size and population (and the least populous of Ireland’s 32 counties), it should not be underestimated. Leitrim has many wonderful attractions and sights to behold. Leitrim has a dramatic hilly and mountainous landscape in its northwest and is relatively flat in the southeast. Lough Allen divides the middle of the county. It is an unspoiled, tranquil area of great natural beauty, consisting of lofty mountains, deep valleys, pastures, lakes, rolling hills and rivers. The extreme northwest Leitrim has a short Atlantic coastline (3 mi) between Sligo and Donegal. Carrick-on-Shannon, Leitrim’s county town, offers stunning views of the Shannon, fun nightlife and culture, and plenty of history with the Carrick Castle, Hatley Manor, and a workhouse and famine graveyard. The Carrick-on-Shannon Rowing Club has been in existence since 1827. Each August the town plays host to the annual August Holiday regatta. In addition to the Arigna Mining Experience, visitors may also learn about Leitrim’s industrial history at the Sliabh na Iarainn Visitor Center, which offers exhibitions and interactive learning experiences about the trade activity between the two mountain regions. The 50-feet-high Glencar Waterfall in Glencar Lough was a source of inspiration to William Butler Yeats. The surrounding area offers many peaceful and scenic walks and picnic spots. Glencar Waterfall in Glencar Lough was a source of inspiration to William Butler Yeats."
	},
	"carlow": {
		"link":"http://www.askaboutireland.ie/learning-zone/primary-students/looking-at-places/carlow/aspects-of-carlow/geography-of-county-carlo/",
		"text": "Carlow is situated in the province of Leinster, in the South-East of Ireland. It lies inland and has no coastline. Carlow is the second-smallest county in Ireland, measuring just 896 square kilometres in area. It is bordered by five other counties: Laois, Kildare, Wicklow, Wexford and Kilkenny. The town of Carlow is the largest in the county and is home to around 40% of Co. Carlow's population. Other towns are Bagenalstown (Muine Bheag), Borris, Hacketstown, Leighlinbridge, Rathvilly and Tullow. Although a small county, Carlow is a vibrant place. It contains many sites of great historical interest, including the famous Browne's Hill Dolmen, which has the largest capstone in Europe at approximately 100 tonnes in weight. Among the most striking physical features of Co. Carlow are the Blackstairs Mountains, situated on the border with Co. Wexford. The well-known peak of Mount Leinster rises here to a height of 735 metres. The Blackstairs are habitat to many heathers and grasses. The wild goats that roam the mountains feed on this vegetation. The River Barrow flows through Carlow town, Bagenalstown (Muinebheag) and onwards through Graiguenamanagh in Co. Kilkenny. It joins the River Nore above New Ross before entering the sea at Waterford Harbour. The Barrow is 192 kilometres long, making it the second-longest river in Ireland. Other rivers in Carlow are the Burrin, which joins the Barrow in Carlow town, and the Slaney, on which the town of Tullow is built. There are now Irish and European laws to protect some of the habitats and the plants found in wet sites, such as bogs. The Blackstairs Mountains and the River Barrow in Carlow are two such areas. These are called Special Areas of Conservation. This means that it is against the law to damage the plants or habitats that are found in these two locations. Carlow is a rich agricultural county in which tillage, sheep and dairy farming are all found. Crops grown include barley, wheat, potatoes and soft fruits. Sugar beet was also widely cultivated for many years because of the sugar processing industry in Carlow town. Carlow has a growing industrial base. Since the 1970s, international companies such as Braun, now Braun Oral B (personal care products), and Läpple (which makes parts for the auto industry), have been established in the county. Other industries include meat processing, agricultural engineering and market gardening. The number of people living in Carlow increased steadily throughout the twentieth century. According to the Preliminary Report of the Census of 2006, the total population of Carlow is now 50,471. In 1926, there were only 34,476 inhabitants. The Census of 2002 showed the population to be 41,616."
	},
	"clare" : {
		"link": "http://www.askaboutireland.ie/learning-zone/primary-students/looking-at-places/clare/aspects-of-clare/about-clare/",
		"text": "Clare is located in the west of Ireland. The Atlantic Ocean borders the west and northwest of the county and the River Shannon borders much of the south. Galway lies to the north, Tipperary to the east and Limerick shares a short border with Clare in the south. Ennis is the county town. Other major towns are Shannon, Kilrush, Newmarket-on-Fergus and Kilkee. The physical landscape in Co. Clare is very varied. There are high Atlantic cliffs and sandy beaches, small mountain ranges and exposed limestone plains. Clare has a coastline of about 360km. The Atlantic Ocean forms a natural boundary to the north, while the Shannon Estuary lies to the south. The Loop Head Peninsula  is bound by the Atlantic and the Shannon Estuary. The tip of Loop Head is the most westerly point in the county. High cliffs are a feature of the Clare coast. The Cliffs of Moher extend for 8km and are 214m high at their highest point. The River Fergus is the main river in the county. The largest lake on the Shannon, Lough Derg, forms a boundary in the east of the county. East Clare is dotted with a number of small lakes. There are two mountain ranges in the east of the county - the Slieve Aughty and Slieve Bernagh Mountains. The highest mountain in Clare is Moylussa (532m) which is found in the Slieve Bernagh range. A distinctive feature of the Clare landscape is the Burren. The Burren is a very large area of exposed carboniferous limestone."
	},
	"cork": {
		"link": "http://www.discoveringcork.ie/things-you-didnt-know-about-cork/",
		"text": "Cork Harbour is said to be the second largest natural harbour in the world after Sydney Harbour. Cork has the oldest Yacht Club in the World founded in 1720. The first motor boat race in the world (The Harmsworth Cup) was held in Cork in 1903. The first Steamship to cross the Atlantic (The Sirius) left Cobh in 1838 (It took 18 days). In 1912, Cobh was the Titanic’s last port of call. The Irish government declared the coastal waters of Ireland a whale and dolphin sanctuary during  the early 1990’s. The first of its kind in Europe. Whale watching off the coast of Cork is said to be the best in Europe with Humpback, Fin & Minke whales regularly seen in addition to many species of dolphin & seals. While Cork has it’s City Charter over 800 years, there has been a settlement here since about 700AD. In the 18th century, Cork had the largest butter market in the world. Legend has it that a certain Marie Louisa Murphy (of Murphy’s Stout fame) had caught the eye of King – Louis XV of France. She became his mistress and money she sent back to Ireland helped start the brewing business we all know & love in Cork. The first factory The Ford Motor Company built outside the USA was in Cork. The city duly became the largest tractor manufacturer in the world for a time in the 1920’s. Sir Walter Raleigh is said to have planted the first potato in Ireland near his home in Youghal around 1588. The World’s first Steeplechase (type of horse race) was run in 1752 between the two steeples of Doneraile & Buttevant in Cork. The first Temperance Society (abstaining from alcohol) in Europe was started in Skibbereen in West Cork in 1833. It has duly been succeeded by Skibbereen’s 26 well patronised pubs! Elizabeth St Leger from Doneraile is the only woman to ever be initiated in to the Freemasons (around 1710). Dursey Island off the coast of the Beara Peninsula has Ireland’s only cable-car. It is licensed to carry 3 people and 1 cow! St Colman’s Cathedral in Cobh has the largest Carillon Bells in Ireland or the UK (49 bells). Kissing the Blarney Stone (located a short distance from Cork City) is said to bestow great eloquence or the ‘Gift of the Gab’. Midleton is proud to be the home of the World’s Biggest Pot Still for making whiskey. It has a capacity of 31,618 gallons. – More than enough for any good party! The 13 arch bridge in the pretty village of Glanworth which was built in the mid-15th century structure, is said to be the narrowest and oldest public bridge in everyday use in Europe. The Fastnet Rock, Ireland’s most southerly point was the last point of Ireland emigrants from Cobh to the USA would see and was known as the ‘Teardrop of Ireland’. The Fastnet gives its name to a classic yacht race from the Isle of Wight to Fastnet Rock and back to Plymouth. (615 miles/ 990Kms). In 1979, 17 people lost their lives in violent storms during the race."
	},
	"dublin": {
		"link": "http://www.dublin.info/facts/",
		"text": "The city is steeped in rich history, starting with the Vikings laying its first streets. Through the centuries, The Craic and an unruly artistic streak have helped shape Dublin into what it is now: A vibrant capital that moves at an easy going pace. Dublin is located on the East Coast of Ireland, stretching along the Irish Sea in a half moon shape. The city is bordered to the South by the dramatic Wicklow Mountains. From the invasion of the Vikings in the 8th Century through 700 years of Norman occupation, English rule and the formation of the Republic of Ireland in the 1920’s, the city of Dublin has had a rich and varied history. Evidence of this can be found in every corner of the city. From a cultural point of view, that means plenty for visitors to see, from historic sites and landmarks to famous monuments and thought-provoking museums. As the capital of Ireland, Dublin has a large number of foreign embassies offering a wide range of services to travellers. At the latest count, Dublin had a total of 53 embassies. Here you will find a list of all countries which maintain an embassy in Dublin as well as the embassies' address details and phone numbers. As a city, Dublin's character is firmly shaped by its people. Dubliners are a friendly and mildly inquisitive lot. Rarely will you venture into a pub without somebody standing near you striking up a conversation. If you ever find yourself lost, ask somebody and more than likely you'll be greeted with a little friendly chat. Dubliners are also known for their sharp wit and deadpan humour. Any bookshop in Ireland will sell you books of 'Dublin Humour'. With three of Ireland's largest universities in town, Dublin is a very young city. Part of Dublin's charm is that all ages and all walks of life mix together. Particularly at night time, this mix makes for a lively and welcoming atmosphere in Dublin's myriad pubs, bars, restaurants, clubs and concert venues. The language spoken in Dublin is English. Street signs and official buildings are signposted in both English and Gaelic, the indigenous Irish language. Despite this, you are highly unlikely to hear any Gaelic spoken on your travels across town. You are, however, likely to come across a lot of cursing in casual conversations. IRelax, it does not carry the same connotations it might in other languages. The currency in use in Ireland is the Euro. Cash machines (ATMs) are widely available. Bank opening hours are typically between 10:00-16:00 Mondays to Fridays. Most hotels, shops, restaurants and some bars accept all major credit cards. Visa and Master Card are the most widely used credit cards in Ireland. If you plan on visiting a pub it is advisable to bring some cash. You will also need cash for taxis and most public transport. Shops are typically open from 9:00-18:00 Mondays to Saturdays. Many shops are open late on Thursdays and Fridays (typically up to 20:00) and a good number is also open from 12:00-18:00 on Sundays. Pubs open at 10:30 and close at 23:30 Mondays to Thursdays, 0:30 on Fridays and Saturdays. On Sundays, pubs open 12:30 and close at 23:30. Clubs and late night bars typically stay open until 2:30. Dublin is a city of two halfs, the Northside and the Southside, divided by the River Liffey in the city centre. The Northside is generally more working class, the Southside is more upmarket. Exceptions apply, but by and large this is a good rule of thumb to apply when exploring the city. Dubliners on both sides can get very passionate about this division and it is the basis of many a joke or smart remark you may overhear in conversation. The Northside of the city is home to the main thoroughfare of Dublin, O'Connell Street, running north-south from Parnell Square, the city's most expensive address in the late 17th century, all the way to the Liffey. The central location of the 1916 Rising, the General Post Office (GPO to Dubliners), is located halfway down O'Connell Street. Henry Street off O'Connell Street is a popular shopping district. Only in Dublin could you find a traditional vegetable market in the middle of it all: Turn off Henry Street into Moore Street and mix with the hustle and bustle of a working street market. The Northside is also home to many museums, theatres, Croke Park Stadium and to Phoenix Park, Europe's largest city park which houses Dublin Zoo. On the Southside, you find the bohemian Temple Bar district with its galleries and nightlife, the main shopping area centred around Grafton Street and the delightful park Saint Stephens Green. In general, you find more trendy and unusual shops in the backstreets to the West of Grafton Street, particularly on Clarendon Street, William Street South, Drury Street and Wicklow Street and Exchequer Street to the North. The Southside is also home to Ireland's oldest and most famous university, Trinity College, the Government Buildings, Dublin Castle, Lansdowne Road Stadium and the oldest parts of the city around Christchurch Cathedral and St Patrick's Cathedral. Venture South along Dublin Bay and you will come to some of Dublin's most picturesque spots. The scenery changes rapidly from flat sandy beaches to rocky cliffs and coves harbouring picture perfect seaside towns and harbours. Sandycove, Dalkey and Killiney have presevered an old world charm. On a sunny day, you can even find an almost Mediterranean atmosphere here. To the North of Dublin you find Howth, a major fishing harbour and Malahide, a quaint seaside town with a park and romantic 19th century castle."
	},
	"galway": {
		"link": "https://www.irishcentral.com/roots/top-ten-facts-about-galway-irelands-cultural-heart-photos-129159213-237762991",
		"text": "Galway city may not be the biggest city in Ireland, but it definitely has the biggest heart. From narrow streets alive with activity and Irish culture to amazing landscapes and seascapes – Galway has it all. Galway is the third largest city in the Republic of Ireland and the only city in the province of Connacht. According to the 2011 census, the population of Galway is 75,414. The park at the center of Galway City is officially called John F. Kennedy Park. However, it is still known by most Irish people as Eyre Square. It was renamed John F. Kennedy Park in the 1970s after the visit of Ireland's favorite US President (sorry, Obama!). The square is home to the old city gates and its defending cannon. Galway is nicknamed “The City of Tribes” (“Cathair na dTreabh”) after the fourteen merchant families who led the city during the Hiberno-Norman period. The city is known for its vibrant lifestyle and numerous festivals, celebrations and events including the summer’s Galway Arts Festival which is known for its famous Macnas (the arts group) parade. There are many symbols associated with Galway. These include the Claddagh Ring, Galway's own symbol of love and friendship, worn the world over; the Aran Sweater, an emblem, not only of the Aran Islands, but of Ireland itself; and the Galway Hookers, ships that distinguish themselves as Galway’s signature upon the water. In 2007, Galway was named one of the top eight “sexiest cities” in the world and in 2008, it was ranked the 42nd best tourist destination in the world and 14th in Europe. There are 6,870 Irish speakers in Galway city, which is nearly ten percent of the population. Galway is often referred to as the “Cultural Heart of Ireland” as it is most associated with the Irish language, music, song and dance traditions. Galway City is on the doorstep of Galway’s Gaeltacht (an area where Irish is spoken). The Aran Islands, probably Ireland’s most famous islands, are located just off the coast of Galway. The three islands – Inishmore, Inishmaan and Inisheer – are the perfect place to visit to see Ireland at its best. They are also Gaeltacht areas. The most famous person born in Galway is the great Hollywood actor Peter O’Toole. Peter Seamus Lorcan O’Toole was born in Connemara in 1932. Most famous for his role in the 1962 film “Lawrence of Arabia,” poor O’Toole holds the world record for Oscar nominations without actually winning. He was nominated an incredible eight times without bringing home a golden statue. The longest place name in Ireland is Muckanaghederdauhaulia, a townland in the civil parish of Kilcummin, County Galway. In Irish, its name is Muiceanach idir Dhá Sháile, meaning 'piggery between two briny places'."
	},
	"kerry": {
		"link": "",
		"text": ""
	},
	"kildare": {
		"link": "",
		"text": ""
	},
	"kilkenny": {
		"link": "",
		"text": ""
	},
	"laois": {
		"link": "",
		"text": ""
	},
	"limerick": {
		"link": "",
		"text": ""
	},
	"longford": {
		"link": "",
		"text": ""
	},
	"mayo": {
		"link": "",
		"text": ""
	}
}





