{
  "cavan": {
    "link": "https://www.carhire.ie/cavanbackground.php",
    "text": "Cavan comes from the old Irish word for ‘hollow’ or ‘little hill’, and all it takes is a few minutes driving in the countryside to understand how the name was attached to this place. It’s a land of drumlins, small-scale hills and ridges that alternate with a spectacular network of wooded lakes. This is ideal country for walking, angling or simply enjoying the outdoors. In the ancient days of Gaelic Ireland, Cavan was part of the Bréifne kingdom, and it remained under the jurisdiction of the O’Reilly clan. This was long before anything resembling the modern-day town was in place. The O’Reillys built a castle in the 1200s, along with St Mary’s Abbey. The bell tower of the Abbey remains an iconic fixture of Cavan to this day, though the rest of the structure was lost. However, the stones of the friary were used to build many historic buildings that are still standing in Cavan. The O’Reilly clan maintained its grip on Cavan until the 1400s, when the Nine Years War saw English troops battling Irish clans for control of the countryside. The clans lost control of the region, and the English brought in Protestant settlers from Scotland to wrest power from those loyal to the Catholic church. This led to further uprisings and rebellions that would continue for centuries through to the War for Irish Independence. Today, Cavan is a hidden gem that many visitors are completely unaware of. Less than a 90 minute drive from Dublin, Cavan is an ideal weekend destination. That said, many visitors leave wishing they had scheduled more time in Ireland’s Lake Lands – especially during the summer months."
  },
  "monaghan": {
    "link": "https://www.monaghantourism.com/index.php/about-county-monaghan",
    "text": "County Monaghan takes its name from the Irish ‘Muineacháin’, meaning ‘little hills’. Inhabited from an early era, many relics of the Bronze Age have been unearthed throughout the county over the years. It was later the centre and heartland of the kingdom of Oriel, and an ancient monument at Donaghmoyne is reputed to have been the residence of the Kings of Oriel. The arrival of Christianity saw St. Patrick visit several locations in the county, while his ‘right-hand man’ – St. Macartan became patron of the diocese of which County Monaghan forms approximately one half.  Tiernach of Clones and Dympna of Tydavnet later became two of Ireland’s best known saints. The Vikings were invaders during the 10-11th centuries and a Viking fort is still visible near Glaslough, while a later Norman motte and bailey stands at Donaghmoyne.  Prior to the 17th century Plantation's County Monaghan was ruled by the McMahons who controlled four fifths of its area, and the McKennas who controlled the remaining one fifth. When the Elizabethans decided in 1585 to divide Ulster into ‘shire-land’, the boundaries of the county were laid out, roughly the same as todays, but it was not until the first decade of the 17th century that the county was officially formed and named. From the 15th to 17th centuries the McMahons and the McKennas formed part of the armies of the O’Neills and were a constant thorn in the side of the English, whose territory ‘The Pale’, just touched the southern end of the present county. In the Nine Years War (1595-1603) the first major battle was fought at Clontibret while the McMahon/McKenna combination also figured in later battles and in the defeat at Kinsale in 1601. Mountjoy’s forces pursued them following that defeat and destroyed many of their fortifications. Elections were always keenly contested in the county, none more so than in 1826 when, on the instigation of Daniel O’Connell, Westenra was elected by the Catholic voters as a pro-Emancipation candidate and again in 1833 when Parnell addressed huge meetings at Castleblayney, Monaghan, Emyvale and Scotstown in support of Tim Healy, who then became the first ever nationalist MP for the county. The Monaghan of today is a county with strong links to its historical past and many towns and villages retain and portray a history and tradition of times long past. There are heritage trails in Monaghan, Clones and Carrickmacross and many sites of historical interest including Edergole Court Tomb, Mannan Castle Motte and Bailey, Inniskeen Round Tower and Lisnadarragh Wedge Tomb."
  },
  "louth": {
    "link": "http://www.irishabroad.com/travel/ireland/midlands/louth/",
    "text": "Situated half way between the two biggest cities in Ireland, Belfast and Dublin, lies the smallest county in Ireland, Louth. The 'Wee County' as it is affectionately known to the Irish is beautifully situated on the North East coats of the island with its long, beautiful beaches stretching away from the towering Mountains of Mourne to the North. Carlingford Lough is one of Ireland's most famous lakes with breathtaking scenery stretching even to the Isle of Man across the Irish Sea. The rugged mountains that tower over the town provide splendid country for hill walking and cater to those in search of the perfect view. Nearby, situated along the Lough is the Tain Holiday Village a 10-acre site with all sorts of water and adventure activities for the whole family and a wide choice of accommodation. From Carlingford one can strike out along the 40 km Tain Way bringing the visitor though the wild and romantic Cooley Peninsula. But if shopping or something more relaxing is what you're after Louth's two biggest towns, Drogheda and Dundalk can see to your needs. One of Ireland's oldest ands most historical towns Drogheda traces its history back to 1194. Drogheda is associated with an extraordinary number of significant events in the history of Ireland - The Battle of the Boyne, St Oliver Plunkett, Poynings Law, Cromwell's Siege and the surrender of the Irish Chieftains to the English King. These days though the town is far more relaxed and the pleasant streets of Drogheda are home to many fine bars and restaurants. Ardee and Dundalk provide alternative bases from which to explore the county but whichever one a guest choose he or she can be assured of a warm reception. Louth's unique situation between the two biggest cities in Ireland has bred a tradition of hospitality into the very ground. The war and friendly atmosphere will be unmistakable wherever you go in the county. With its mix of the modern and the mythic, the urban and the unusual Louth becomes more and more attractive to visitors with each passing year. Convenient to the big cities and with accommodation to suit every budget a visit is highly recommended."
  },
  "meath": {
    "link": "https://www.tripsavvy.com/county-meath-and-newgrange-1542094",
    "text": "The Irish name of County Meath is Contae na Mhí, the literal (and rather unexciting) meaning being 'The Middle'. Together with County Westmeath, County Meath once formed the 'Fifth Province of Ireland, the one politically in the middle of things. Cars registered in County Meath will have the letters MH on their number plates. The county town is Navan, other important towns include Ashbourne, Dunboyne, Dunshaughlin, Kells, Oldcastle, and Trim. Especially those towns near to the Dublin border have grown immensely during the boom years, housing commuters more than anything else. Meath has a size of 2,338 square kilometers. According to the 2011 census, 184,135 people live here - since 1991, the population of County Meath grew by 75%, this is the highest population growth in Ireland and mainly due to Dublin 'expanding'. The most common county nickname is 'Royal Meath', after the former seat of the Irish High Kings on the Hill of Tara. With the 1690 battle site Boyne river, Meath has the most important 'pilgrimage site' for Unionists. Meath is not only the 'Royal County', but chock-a-block with historic and majestic sites. Pride of place must, however, go to Bru na Bóinne, which provides a very informative visitor center and a gateway to the passage tombs of Newgrange and Knowth. Access to both is by guided tour only and all start at the visitor center (which is well sign-posted, but actually on the other side of the river). The reconstruction of the mound at Newgrange might be debatable, but impressive it is. If you want to get away from the (in summer often) maddening crowd, make your own way to Dowth - the third major mound of the Bru na Bóinne complex, freely accessible, not restored and often left in solitary peace. Maybe second in fame only to Newgrange, the Hill of Tara is more a general feeling of antiquity than a tangible sight. When you come here, you'll see something akin to a not-very-well-kept golf course or rough-ish landscape park. Only with a guidebook and some imagination will you be able to explore the hidden wonders of this sprawling complex. The audio- visual show in the visitor center helps a lot, walking the Hill of Tara with an open mind and a bit of time will (maybe) open up its mysteries to you. Those tourists jumping from the bus, checking off their list and having a quick gander will not get the most from this site. Personally, we recommend cold, crisp winter mornings around sunrise - if you can live with the sheep droppings. Tayto Park is a 'theme park' in County Meath and geared at families with children, though the selection of animals on view makes it interesting for adults too. It is very good for a day out with the family, quite good if you visit without kids and are not on the lookout for peace and quiet. The focus is on physical activity and a learning experience, a very welcome change from passive entertainment. This is a top destination if you need to keep the kids amused in the greater Dublin area and the weather is with you."
  },
  "westmeath": {
    "link": "http://www.rootsireland.ie/about-westmeath/",
    "text": "County Westmeath is sometimes referred to as “The Lake County” due to the abundance of lakes, streams and other waterways in the county. This inland county is part of the midlands and is in the province of Leinster. County Westmeath has a long and colourful history that predates its official charter. It is said that this was the meeting place of the five ancient provinces of Ireland. Prior to the arrival of St. Patrick, the county was the gathering place for the High Kings of Ireland. The Normans arrived about 1170 and built many castles and forts. The county was officially established in 1543 and was named after the historic kingdom of Mide. The county was centrally involved in the 1641 rebellion and was active in the Williamite wars. Most of the Irish or Norman landholders lost their land following the 1641 rebellion. Throughout the county you will find remarkable evidence of the region’s long and colourful past. Uisneagh Hill is an impressive hill nearly 180 meters tall. It is here that King Tuathal Teachmar erected his palace in the early second century. For two hundred years the pagan kings of Ireland ruled. There are many castles located within the county. Perhaps the most famous is Tullynally. This castle, which is still lived in by the family of the Earl of Longford, is a beautiful castle that is nearly a quarter of a mile long. One of the oldest Castles in Westmeath is Delvin Castle, built in 1181 by Hugh De Lacy. Athlone Castle was built in 1210 for King John of England. It was strategically placed to guard one of the main crossings of the River Shannon. Crookedwood Fort is one of the oldest structures in the county. It is related to the old Stories of Fionn, the mythological hunter and warrior or the Druids. Nearby at Taughmon is a fourteenth century fortified stone church. Many of the towns located within the county have their own distinct histories. The town of Fore is a medieval town containing a large moat from Anglo-Norman times. There are remnants of the ancient city walls and a Benedictine Monastery that was in use until Henry VIII closed it in 1539. The monastery contains superior ancient artwork and crosses. The population of Westmeath in 1841 was 141,300. During the Great Famine of 1845-1847, the population decreased until it was 111,407 in 1851. The population continued to decrease to 56,818 in 1926. In 2011, the population was 86,164."
  },
  "donegal": {
    "link": "http://www.donegallanguageschool.com/glimpse-bundoran/",
    "text": "Donegal often called the “forgotten county?” is one of Ireland’s most beautiful counties. We have put together some interesting facts for anyone visiting the area. Donegal is situated in the north-west of Ireland and is surrounded by 5 counties including Sligo, Leitrim, Derry, Tyrone and Fermanagh making it a perfect platform to explore some hidden beauties. The County has six hundred and fifty kilometres of rugged coastline and sandy beaches to explore. Tory Island off of Donegal has a King. This is a unique tradition that does not exist anywhere else in Ireland. The current Rí Thoraí (Irish for King of Tory) is painter Patsaí Dan Mac Ruaidhrí (Patsy Dan Rodgers in English). The king has no formal powers; though duties include being a spokesperson for the island community and welcoming people to the island. The total population of the Island is under 200. Donegal has the second-largest Gaeltacht(where Irish is the first language) area in the whole of Ireland. Some famous people that have hailed from Donegal include the world famour singer Enya, the renowned trad group Clannad, country and western crooner Daniel O Donnnell, rock legend Rory Gallagher and for those of literary interest the poet William Allingham. All in all Donegal is a great place to visit while on holidays in Ireland."
  },
  "leitrim": {
    "link": "https://www.irishcentral.com/roots/county-leitrim-87161507-237773921",
    "text": "In ancient times Leitrim formed the western half of the Kingdom of Breifne, which from 1256 onwards was ruled over by the O’Rourke family. The O’Rourke’s heraldic symbol of the lion still has a presence in Leitrim’s official crest. Normans invaded in the 13th century and occupied the southern portion of the kingdom, though the O’Rourkes more or less maintained control through the 16th century, when modern day Leitrim was carved out of the ancient Kingdom of Breifne. The county suffered a number of rough blows in the mid-1800s. First, there was a recession caused by the mechanization of linen weaving (one of the county’s prime exports) in the 1830's. Then the Great Famine saw Leitrim's population of 155,000 (as of the 1841 census) plummet to 112,000 by 1851. In addition to the linen industry, Leitrim was also noted for its coal mining and mining of iron ore. The county’s last coal mine remained open until 1990 and now functions as a visitor center, the Arigna Mining Experience. Key attractions: Though Leitrim is the smallest of Connacht’s five counties in both size and population (and the least populous of Ireland’s 32 counties), it should not be underestimated. Leitrim has many wonderful attractions and sights to behold. Leitrim has a dramatic hilly and mountainous landscape in its northwest and is relatively flat in the southeast. Lough Allen divides the middle of the county. It is an unspoiled, tranquil area of great natural beauty, consisting of lofty mountains, deep valleys, pastures, lakes, rolling hills and rivers. The extreme northwest Leitrim has a short Atlantic coastline (3 mi) between Sligo and Donegal. Carrick-on-Shannon, Leitrim’s county town, offers stunning views of the Shannon, fun nightlife and culture, and plenty of history with the Carrick Castle, Hatley Manor, and a workhouse and famine graveyard. The Carrick-on-Shannon Rowing Club has been in existence since 1827. Each August the town plays host to the annual August Holiday regatta. In addition to the Arigna Mining Experience, visitors may also learn about Leitrim’s industrial history at the Sliabh na Iarainn Visitor Center, which offers exhibitions and interactive learning experiences about the trade activity between the two mountain regions. The 50-feet-high Glencar Waterfall in Glencar Lough was a source of inspiration to William Butler Yeats. The surrounding area offers many peaceful and scenic walks and picnic spots. Glencar Waterfall in Glencar Lough was a source of inspiration to William Butler Yeats."
  },
  "carlow": {
    "link":"http://www.askaboutireland.ie/learning-zone/primary-students/looking-at-places/carlow/aspects-of-carlow/geography-of-county-carlo/",
    "text": "Carlow is situated in the province of Leinster, in the South-East of Ireland. It lies inland and has no coastline. Carlow is the second-smallest county in Ireland, measuring just 896 square kilometres in area. It is bordered by five other counties: Laois, Kildare, Wicklow, Wexford and Kilkenny. The town of Carlow is the largest in the county and is home to around 40% of Co. Carlow's population. Other towns are Bagenalstown (Muine Bheag), Borris, Hacketstown, Leighlinbridge, Rathvilly and Tullow. Although a small county, Carlow is a vibrant place. It contains many sites of great historical interest, including the famous Browne's Hill Dolmen, which has the largest capstone in Europe at approximately 100 tonnes in weight. Among the most striking physical features of Co. Carlow are the Blackstairs Mountains, situated on the border with Co. Wexford. The well-known peak of Mount Leinster rises here to a height of 735 metres. The Blackstairs are habitat to many heathers and grasses. The wild goats that roam the mountains feed on this vegetation. The River Barrow flows through Carlow town, Bagenalstown (Muinebheag) and onwards through Graiguenamanagh in Co. Kilkenny. It joins the River Nore above New Ross before entering the sea at Waterford Harbour. The Barrow is 192 kilometres long, making it the second-longest river in Ireland. Other rivers in Carlow are the Burrin, which joins the Barrow in Carlow town, and the Slaney, on which the town of Tullow is built. There are now Irish and European laws to protect some of the habitats and the plants found in wet sites, such as bogs. The Blackstairs Mountains and the River Barrow in Carlow are two such areas. These are called Special Areas of Conservation. This means that it is against the law to damage the plants or habitats that are found in these two locations. Carlow is a rich agricultural county in which tillage, sheep and dairy farming are all found. Crops grown include barley, wheat, potatoes and soft fruits. Sugar beet was also widely cultivated for many years because of the sugar processing industry in Carlow town. Carlow has a growing industrial base. Since the 1970s, international companies such as Braun, now Braun Oral B (personal care products), and Läpple (which makes parts for the auto industry), have been established in the county. Other industries include meat processing, agricultural engineering and market gardening. The number of people living in Carlow increased steadily throughout the twentieth century. According to the Preliminary Report of the Census of 2006, the total population of Carlow is now 50,471. In 1926, there were only 34,476 inhabitants. The Census of 2002 showed the population to be 41,616."
  },
  "clare" : {
    "link": "http://www.askaboutireland.ie/learning-zone/primary-students/looking-at-places/clare/aspects-of-clare/about-clare/",
    "text": "Clare is located in the west of Ireland. The Atlantic Ocean borders the west and northwest of the county and the River Shannon borders much of the south. Galway lies to the north, Tipperary to the east and Limerick shares a short border with Clare in the south. Ennis is the county town. Other major towns are Shannon, Kilrush, Newmarket-on-Fergus and Kilkee. The physical landscape in Co. Clare is very varied. There are high Atlantic cliffs and sandy beaches, small mountain ranges and exposed limestone plains. Clare has a coastline of about 360km. The Atlantic Ocean forms a natural boundary to the north, while the Shannon Estuary lies to the south. The Loop Head Peninsula  is bound by the Atlantic and the Shannon Estuary. The tip of Loop Head is the most westerly point in the county. High cliffs are a feature of the Clare coast. The Cliffs of Moher extend for 8km and are 214m high at their highest point. The River Fergus is the main river in the county. The largest lake on the Shannon, Lough Derg, forms a boundary in the east of the county. East Clare is dotted with a number of small lakes. There are two mountain ranges in the east of the county - the Slieve Aughty and Slieve Bernagh Mountains. The highest mountain in Clare is Moylussa (532m) which is found in the Slieve Bernagh range. A distinctive feature of the Clare landscape is the Burren. The Burren is a very large area of exposed carboniferous limestone."
  },
  "cork": {
    "link": "http://www.discoveringcork.ie/things-you-didnt-know-about-cork/",
    "text": "Cork Harbour is said to be the second largest natural harbour in the world after Sydney Harbour. Cork has the oldest Yacht Club in the World founded in 1720. The first motor boat race in the world (The Harmsworth Cup) was held in Cork in 1903. The first Steamship to cross the Atlantic (The Sirius) left Cobh in 1838 (It took 18 days). In 1912, Cobh was the Titanic’s last port of call. The Irish government declared the coastal waters of Ireland a whale and dolphin sanctuary during  the early 1990’s. The first of its kind in Europe. Whale watching off the coast of Cork is said to be the best in Europe with Humpback, Fin & Minke whales regularly seen in addition to many species of dolphin & seals. While Cork has it’s City Charter over 800 years, there has been a settlement here since about 700AD. In the 18th century, Cork had the largest butter market in the world. Legend has it that a certain Marie Louisa Murphy (of Murphy’s Stout fame) had caught the eye of King – Louis XV of France. She became his mistress and money she sent back to Ireland helped start the brewing business we all know & love in Cork. The first factory The Ford Motor Company built outside the USA was in Cork. The city duly became the largest tractor manufacturer in the world for a time in the 1920’s. Sir Walter Raleigh is said to have planted the first potato in Ireland near his home in Youghal around 1588. The World’s first Steeplechase (type of horse race) was run in 1752 between the two steeples of Doneraile & Buttevant in Cork. The first Temperance Society (abstaining from alcohol) in Europe was started in Skibbereen in West Cork in 1833. It has duly been succeeded by Skibbereen’s 26 well patronised pubs! Elizabeth St Leger from Doneraile is the only woman to ever be initiated in to the Freemasons (around 1710). Dursey Island off the coast of the Beara Peninsula has Ireland’s only cable-car. It is licensed to carry 3 people and 1 cow! St Colman’s Cathedral in Cobh has the largest Carillon Bells in Ireland or the UK (49 bells). Kissing the Blarney Stone (located a short distance from Cork City) is said to bestow great eloquence or the ‘Gift of the Gab’. Midleton is proud to be the home of the World’s Biggest Pot Still for making whiskey. It has a capacity of 31,618 gallons. – More than enough for any good party! The 13 arch bridge in the pretty village of Glanworth which was built in the mid-15th century structure, is said to be the narrowest and oldest public bridge in everyday use in Europe. The Fastnet Rock, Ireland’s most southerly point was the last point of Ireland emigrants from Cobh to the USA would see and was known as the ‘Teardrop of Ireland’. The Fastnet gives its name to a classic yacht race from the Isle of Wight to Fastnet Rock and back to Plymouth. (615 miles/ 990Kms). In 1979, 17 people lost their lives in violent storms during the race."
  },
  "dublin": {
    "link": "http://www.dublin.info/facts/",
    "text": "The city is steeped in rich history, starting with the Vikings laying its first streets. Through the centuries, The Craic and an unruly artistic streak have helped shape Dublin into what it is now: A vibrant capital that moves at an easy going pace. Dublin is located on the East Coast of Ireland, stretching along the Irish Sea in a half moon shape. The city is bordered to the South by the dramatic Wicklow Mountains. From the invasion of the Vikings in the 8th Century through 700 years of Norman occupation, English rule and the formation of the Republic of Ireland in the 1920’s, the city of Dublin has had a rich and varied history. Evidence of this can be found in every corner of the city. From a cultural point of view, that means plenty for visitors to see, from historic sites and landmarks to famous monuments and thought-provoking museums. As the capital of Ireland, Dublin has a large number of foreign embassies offering a wide range of services to travellers. At the latest count, Dublin had a total of 53 embassies. Here you will find a list of all countries which maintain an embassy in Dublin as well as the embassies' address details and phone numbers. As a city, Dublin's character is firmly shaped by its people. Dubliners are a friendly and mildly inquisitive lot. Rarely will you venture into a pub without somebody standing near you striking up a conversation. If you ever find yourself lost, ask somebody and more than likely you'll be greeted with a little friendly chat. Dubliners are also known for their sharp wit and deadpan humour. Any bookshop in Ireland will sell you books of 'Dublin Humour'. With three of Ireland's largest universities in town, Dublin is a very young city. Part of Dublin's charm is that all ages and all walks of life mix together. Particularly at night time, this mix makes for a lively and welcoming atmosphere in Dublin's myriad pubs, bars, restaurants, clubs and concert venues. The language spoken in Dublin is English. Street signs and official buildings are signposted in both English and Gaelic, the indigenous Irish language. Despite this, you are highly unlikely to hear any Gaelic spoken on your travels across town. You are, however, likely to come across a lot of cursing in casual conversations. IRelax, it does not carry the same connotations it might in other languages. The currency in use in Ireland is the Euro. Cash machines (ATMs) are widely available. Bank opening hours are typically between 10:00-16:00 Mondays to Fridays. Most hotels, shops, restaurants and some bars accept all major credit cards. Visa and Master Card are the most widely used credit cards in Ireland. If you plan on visiting a pub it is advisable to bring some cash. You will also need cash for taxis and most public transport. Shops are typically open from 9:00-18:00 Mondays to Saturdays. Many shops are open late on Thursdays and Fridays (typically up to 20:00) and a good number is also open from 12:00-18:00 on Sundays. Pubs open at 10:30 and close at 23:30 Mondays to Thursdays, 0:30 on Fridays and Saturdays. On Sundays, pubs open 12:30 and close at 23:30. Clubs and late night bars typically stay open until 2:30. Dublin is a city of two halfs, the Northside and the Southside, divided by the River Liffey in the city centre. The Northside is generally more working class, the Southside is more upmarket. Exceptions apply, but by and large this is a good rule of thumb to apply when exploring the city. Dubliners on both sides can get very passionate about this division and it is the basis of many a joke or smart remark you may overhear in conversation. The Northside of the city is home to the main thoroughfare of Dublin, O'Connell Street, running north-south from Parnell Square, the city's most expensive address in the late 17th century, all the way to the Liffey. The central location of the 1916 Rising, the General Post Office (GPO to Dubliners), is located halfway down O'Connell Street. Henry Street off O'Connell Street is a popular shopping district. Only in Dublin could you find a traditional vegetable market in the middle of it all: Turn off Henry Street into Moore Street and mix with the hustle and bustle of a working street market. The Northside is also home to many museums, theatres, Croke Park Stadium and to Phoenix Park, Europe's largest city park which houses Dublin Zoo. On the Southside, you find the bohemian Temple Bar district with its galleries and nightlife, the main shopping area centred around Grafton Street and the delightful park Saint Stephens Green. In general, you find more trendy and unusual shops in the backstreets to the West of Grafton Street, particularly on Clarendon Street, William Street South, Drury Street and Wicklow Street and Exchequer Street to the North. The Southside is also home to Ireland's oldest and most famous university, Trinity College, the Government Buildings, Dublin Castle, Lansdowne Road Stadium and the oldest parts of the city around Christchurch Cathedral and St Patrick's Cathedral. Venture South along Dublin Bay and you will come to some of Dublin's most picturesque spots. The scenery changes rapidly from flat sandy beaches to rocky cliffs and coves harbouring picture perfect seaside towns and harbours. Sandycove, Dalkey and Killiney have presevered an old world charm. On a sunny day, you can even find an almost Mediterranean atmosphere here. To the North of Dublin you find Howth, a major fishing harbour and Malahide, a quaint seaside town with a park and romantic 19th century castle."
  },
  "galway": {
    "link": "https://www.irishcentral.com/roots/top-ten-facts-about-galway-irelands-cultural-heart-photos-129159213-237762991",
    "text": "Galway city may not be the biggest city in Ireland, but it definitely has the biggest heart. From narrow streets alive with activity and Irish culture to amazing landscapes and seascapes – Galway has it all. Galway is the third largest city in the Republic of Ireland and the only city in the province of Connacht. According to the 2011 census, the population of Galway is 75,414. The park at the center of Galway City is officially called John F. Kennedy Park. However, it is still known by most Irish people as Eyre Square. It was renamed John F. Kennedy Park in the 1970s after the visit of Ireland's favorite US President (sorry, Obama!). The square is home to the old city gates and its defending cannon. Galway is nicknamed “The City of Tribes” (“Cathair na dTreabh”) after the fourteen merchant families who led the city during the Hiberno-Norman period. The city is known for its vibrant lifestyle and numerous festivals, celebrations and events including the summer’s Galway Arts Festival which is known for its famous Macnas (the arts group) parade. There are many symbols associated with Galway. These include the Claddagh Ring, Galway's own symbol of love and friendship, worn the world over; the Aran Sweater, an emblem, not only of the Aran Islands, but of Ireland itself; and the Galway Hookers, ships that distinguish themselves as Galway’s signature upon the water. In 2007, Galway was named one of the top eight “sexiest cities” in the world and in 2008, it was ranked the 42nd best tourist destination in the world and 14th in Europe. There are 6,870 Irish speakers in Galway city, which is nearly ten percent of the population. Galway is often referred to as the “Cultural Heart of Ireland” as it is most associated with the Irish language, music, song and dance traditions. Galway City is on the doorstep of Galway’s Gaeltacht (an area where Irish is spoken). The Aran Islands, probably Ireland’s most famous islands, are located just off the coast of Galway. The three islands – Inishmore, Inishmaan and Inisheer – are the perfect place to visit to see Ireland at its best. They are also Gaeltacht areas. The most famous person born in Galway is the great Hollywood actor Peter O’Toole. Peter Seamus Lorcan O’Toole was born in Connemara in 1932. Most famous for his role in the 1962 film “Lawrence of Arabia,” poor O’Toole holds the world record for Oscar nominations without actually winning. He was nominated an incredible eight times without bringing home a golden statue. The longest place name in Ireland is Muckanaghederdauhaulia, a townland in the civil parish of Kilcummin, County Galway. In Irish, its name is Muiceanach idir Dhá Sháile, meaning 'piggery between two briny places'."
  },
  "kerry": {
    "link": "https://www.irishcentral.com/travel/top-10-interesting-facts-about-county-kerry-photos",
    "text": "With stunning sights such as the Ring of Kerry, the Dingle Peninsula, and the Skellig Islands, County Kerry is one of the most famous and beautiful of Ireland’s 32 counties. County Kerry’s Irish motto, “Comhar, Cabhair, Cairdeas,” translates to “Cooperation, Help and Friendship.” The blue and white mountains in the center of the County Kerry crest symbolize Kerry’s mountains – the highest in Ireland. The crown at the top stands for the Ciarraige, the pre-Gaelic people who gave their name to the county. The crosses on either side of it represent the monasteries of Ardfert and Aghadoe. The boat represents St. Brendan the navigator, who is said to have discovered America long before Columbus did. Carrauntoohil, in the MacGillycuddy Reeks range, is Ireland’s highest mountain, standing at 3,409 feet. The Reeks themselves stretch across 12 miles of the stunning Kerry landscape and also include Ireland’s second and third highest mountains – Beenkeragh (3,313 feet) and Caher (3,284 feet). The Reeks are also home to Ireland’s highest lake, Cummeenoughter Lake, nicknamed “The Devil’s Looking Glass,” which is 2,320 feet above sea level.The Conor Pass, near Dingle, is Ireland’s highest mountain pass. Tom Crean (1877 – 1938) was born near Annascaul, Co. Kerry. A seaman and Antarctic explorer, he was part of the Discovery and Terra Nova expeditions led by Captain Robert Falcon Scott to the South Pole. He was also part of Ernest Shackleton’s mission on board the ship Endurance (1914-16), and became the hero of the doomed venture. During the Endurance expedition the crew abandoned ship after it became locked in the ice of the Wendell Sea. They sailed in three small boats to the desolate Elephant Island before Crean and five companions, including Shackleton, journeyed 800 miles in the tiny James Caird to South Georgia, marched 40 miles across its uncharted, glaciered interior to reach a whaling station and returned for the castaways on Elephant Island. After making it to safety, Cream returned to Annascaul, where he set up the pub, The South Pole, with his wife, Ellen. Valentia was the eastern terminus of the first commercially viable transatlantic telegraph cable which stretched from from Valentia to Heart's Content, Newfoundland in 1866. Transatlantic telegraph cables operated from Valentia Island for one hundred years, linking Europe and America for the first time ever. It’s said in Kerry that, “There are only two kingdoms, the Kingdom of God and the Kingdom of Kerry.” Use of the nickname “The Kingdom” to refer to Kerry dates back to 65 AD when one of the O’Connor clan took control of the area. The O’Connor chieftain’s name was “Ciar” (pronounced “keer”) and his descendants became known as “Ciar-raigh,” (pronounced “keer-ree”), which roughly translates to “Ciar’s people” or “Ciar’s kingdom.” Ciarraigh was later anglicized to Kerry. The silent film star, whose last wife, Oona O’Neill (daughter of playwright Eugene O’Neill) had Irish ancestry, found a home away from home in Waterville, Co. Kerry. Chaplin (1889 – 1977) traveled with his family to Waterville many times throughout the 60s and 70s , often staying at the Butler Arms Hotel. To this day, a statue of Chaplin overlooks Ballinaskelligs Bay in Waterville, and each summer the town is host to the Charlie Chaplin Comedy Film Festival. It is widely believed that James Bond’s boss, “M,” was inspired by a man named William Melville (1850 – 1918) from Sneem, Co. Kerry. After moving to London as a young man, he joined the then newly formed London Metropolitan Police, where he was a founder of the Special Irish Branch, which monitored Irish Nationalists and subversives. Melville was a Catholic and supported Home Rule for Ireland. In 1903, Melville became head of the British Secret Service and went by the code name “M” to hide his identity. In 1909, the British War Office set up a counter-espionage service, the secret Service Bureau, later named MI5 and MI6. William Melville was appointed Chief of the Bureau, and many of the tactics and methods developed by him are still in use to this day. The nature and secrecy of Melville’s work meant he was practically unknown. However, the creator of James Bond, Ian Fleming, did know about him because he too worked for the Secret Service. More than 385 million years ago a large amphibian animal walked on soft sediment on the shoreline of Valentia Island in Co. Kerry. The footprints are preserved in the rock as shallow impressions. This large amphibian was known as a Tetrapod and the footprints are the oldest known fossilized footprints in the world. They are also the earliest record of vertebrates moving onto land, breathing air, walking on all four limbs, and are also the first fossil record of an amphibian animal. Puck Fair, Ireland’s oldest traditional festival, is over 400 years old. It is the only festival in the world where a wild mountain goat is crowned king. The festival, which runs from August 10 to 12 and is expected to attract 80,000 visitors this year, was said to be linked to the Celtic festival of Lughnasa, which symbolizes the beginning of harvest. The goat was a symbol of pagan fertility. Every year locals captured a wild goat in the Macgillycuddy Reeks and brought it back to town. Mulvihill writes that one of the best-known goat catchers was Michael 'Butty' Sugrue, once known as Ireland's strongest man. The “Queen of Puck,” usually a young schoolgirl crowns the goat “King Puck.” The goat is placed in a small cage on a high stand for three days as the locals celebrate with markets, entertainment and pubs staying open until 3am. At the end of the fair the goat is released back into the wild."
  },
  "kildare": {
    "link": "http://www.kildare.ie/aboutus/aboutKildare.asp",
    "text": "County Kildare takes its name from St. Brigid’s monastery beneath an oak tree; Cill Dara, the church of the oak tree. As an inland county, Kildare's landscape shares many of its features with its neighbours, but it has the advantage of the Wicklow mountain range to the east, with the foothills spreading westwards to meet the Curragh of Kildare. It extends into the undulating central lowlands, beneath which the layers of carboniferous limestone, sand and gravel provide good drainage. The great raised Bog of Allen on the western side of the county, with its covering of black peat and mantle of heather and gorse, is a dramatic contrast to the well-tilled fields of south Kildare, or to the bright green paddocks and the wooded estates of the livestock and stud farms scattered throughout the county. Three great rivers water the county, the Liffey which flows northwards from the Wicklow mountains to enter the sea at Dublin, the Barrow which forms the border of the county with Laois, and the legendary Boyne, the fount of which is beneath the historic hill of Carbury. Both the Grand and Royal canals traverse the county, the Royal along the northern boundaries, and the Grand which crosses the county from Lyons on the east to Rathangan and Monasterevan on the west, and with a line southwards to join the Barrow navigation at Athy. Kildare has a long and well-documented history with abundant physical evidence of ancient habitation. The tall granite standing stones at Punchestown, the stone circle at Broadlease, the hill forts at Dun Ailinne, Sillagh and Hughstown, and the many raths and other earthworks of the Curragh are all reminders of early settlers. There are early Christian sites at Kildare, Taghadoe, Old Kilcullen and Timolin."
  },
  "kilkenny": {
    "link": "http://www.world-guides.com/europe/ireland/county-kilkenny/kilkenny/",
    "text": "Kilkenny (Cill Chainnigh) is the most beautiful heritage city in the entire country, attracting a huge number of tourism arrivals every year. Its historic sites are concentrated in the city centre and easily accessible on foot. Kilkenny has been a focus for tourism for many years and in 2009 celebrated the 400th anniversary of its status as a city, boosting its visitor numbers still further. Appearing more like a small town, the city is a treasure-house for architecture and history buffs, with many heritage buildings dating from Norman times through medieval and Tudor periods up to the 19th century, all within walking distance of city centre hotels, restaurants and entertainment venues. Accommodation options across this historic county are wide, ranging from traditional luxury and contemporary modernity to cosy pubs and B&Bs with traditionally warm Irish welcomes. Tourist information can be easily accessed at the Kilkenny Tourism Office in the 16th-century Shee Alms House on Rose Inn Street. Many of the city's tourist attractions are packed with character, with churches and historic houses lining the winding streets, medieval city walls and the River Nore. Kilkenny Castle is especially grand and dates as far back as the 12th century, although it is clear to see that the castle has undergone many modifications over the centuries, with a number of prominent changes being made during the 19th century. Picture of Kilkenny CastleGuided tours of the castle's Long Gallery last around 40 minutes, during which time tourists will be able to admire both pre-Raphaelite and Celtic art works. Also worth visiting in Kilkenny is the Butler Dower House on Patrick Street and its fairytale turrets, while on Parliament Street you will find the Black Abbey and also the renowned St. Francis Abbey Brewery, where various different beers can be tasted and purchased. Apart from the castle, Kilkenny contains a number of additional landmarks, including no less than two cathedrals. St. Canice's Cathedral is especially impressive and Ireland's second-biggest, dominating the northern side of the city centre with its imposing Gothic architecture and tall 9th-century Round Tower. Considerably younger is St. Mary's Cathedral, which was completed in the middle of the 19th century and constructed using locally sourced limestone. Further interest for sightseers comes in the form of the semi-circular Kilkenny Design Centre, the Thosel building (formerly the city's customs house and guildhall), and the two famous bridges of Kilkenny - Green's Bridge and John's Bridge. Although there is no denying that Kilkenny is a small city, it does come with a number of museums and similar cultural attractions. Close to the Black Abbey are the exhibits by the Kilkenny Archaeological Society at Rothe House, a 17th-century townhouse boasting Renaissance architecture and endless period features. At the Shee Alms House, the Cityscape Exhibit features miniature model houses and shows how the city once appeared, a few centuries ago. Further museums are to be found close by, in the neighbouring villages of Bennetsbridge and Tullaroan. For a taste of art, head to Kilkenny Castle on the Parade, where both the Butler Gallery and the National Craft Gallery will oblige. County Kilkenny occupies a charming part of Southern Ireland and many attractions lie within reach of the city, such as Grennan Castle, Jenkinstown Park, Jerpoint Abbey and the Kells Augustinian Priory. Also in County Kilkenny are the Dunmore Caves, where guided tours tell of the thousands of skeletons once unearthed here and the Viking battles that took place in this area. Close by are the counties of Waterford and Wexford, where further day trips are possible. Excursions to the small city of Waterford are especially popular and many of its attractions are based around the banks of the River Suir, where they are accompanied by a good choice of Irish pubs and restaurants. In the county town of Wexford, the recently redeveloped quayfront is central to the action. "
  },
  "laois": {
    "link": "https://www.ireland101.com/page/laois",
    "text": "Laois is Ireland's most landlocked county, bordering on no other coastal counties. Mostly pastoral countryside and bogs, Laois brings in relatively few visitors, save for the first weekend in September, when hordes of musos and fanboys pour in for the Electric Picnic rock festival at Stradbally Hall. Formerly known as 'Queen's County', Laois got its current name after the establishment of the Irish Free State in 1922. The county town, Portlaoise, has seen a fair bit of industrial development over the past decade, but many Laoise residents opt to commute to Kildare or as far afield as Dublin for high-tech jobs. The Slieve Bloom Mountains cover a huge portion of the northwest part of Laois, spilling over into Co. Offaly and providing some 480 km of walking trails, including the well-trodden Slieve Bloom Way. Historically, Laois goes back thousands of years. A preserved Bronze Age stone circle at Monamonry and several hill forts at Clopook, Monelly and, especially, Skirk, offer a view to the county's ancient past. Early Christian remains culminate in the Rock of Dunamase, a 9th century monastic fort that was partially blown up by Oliver Cromwell's invading armies in the 17th century. The impressive Emo Court House and Gardens in Portlaoise were built in the 1790s for an English earl and strongly resemble the austere, neoclassical style of architect James Gandon, who also designed the Four Courts and Custom House in Dublin. Interestingly and perhaps surprisingly, Laois became the first place in Ireland with an African mayor, when in 2009, Portlaoise elected Nigerian-born Rotimi Adebari to office. Other notable Laois people include the first Roman Catholic mayor of New York City, William Russell Grace, as well as beloved Irish celebrity chef, Darina Allen, who was born in Portlaoise."
  },
  "limerick": {
    "link": "https://www.limerick.ie/limerick-insider/10-facts-you-didnt-know-about-limerick",
    "text": "Limerick is Ireland’s third largest city and was founded by the Vikings in 812. Limerick is one of Ireland’s oldest cities, with a Charter of Incorporation older than that of London’s, dating back to 1197! Limerick is home to the largest Georgian Quarter in Ireland outside Dublin! Former US President, John F. Kennedy’s great-grandfather, Thomas Fitzgerald (the man who gave them the ‘F’ in their name), hails from the town of Bruff in east Co. Limerick! There are 10 places in the USA called Limerick: Limerick, Georgia, Limerick, Illinois, Limerick, Louisville, Limerick, Maine, Limerick, Mississippi, Limerick, New York, Limerick, Ohio, Limerick, South Carolina, Limerick Township, Pennsylvania, and New Limerick, Maine! Irish Coffee, a brew infused with Irish whiskey, was invented in Limerick village Foynes in 1943! Limerick is known as the Treaty City after the Treaty of Limerick was signed here in October 1691! Some of Limerick’s well-known sons and daughters include actor Richard Harris, rock legends The Cranberries, broadcaster Terry Wogan, novelist and playwright Kate O’Brien and Pulitzer Prize-winning author Frank McCourt! In 1651 after Cromwell’s forces captured the City, St. Mary's Cathedral was used as a stable for the army’s horses! King John’s Castle is the westernmost Norman castle in Europe! The University of Limerick has the longest footbridge in Ireland and one of the longest footbridges in Europe - it is called the Living Bridge!"
  },
  "longford": {
    "link": "http://www.longfordtourism.ie/about/county-longford/",
    "text": "Once part of the ancient lands of Teffia and later Annaly – ancestral home of the Farrell Clan – Longford is a tranquil and mainly low-lying county. Cairn Hill, referred to affectionately by locals as Corn Hill, is the highest point of the county, standing at  916 feet. Situated in the basin of the River Shannon and the upper catchment area of the River Erne, Longford is ideally located in the heart of the Lakelands region. Its accessibility to many of Irelands main towns and cities make it a prime location as a holiday base. Within easy reach of many stunning and historic national tourist attractions, Longford is also rightly proud of its own; Corlea Trackway Visitor Centre, Ardagh Heritage Village and Ballinamuck Visitor Centre to name but a few. It also boasts a wealth of artistic, dramatic,  literary and musical tradition to entertain visitors to the area. The true beauty of County Longford lies in its rural charm, the hospitality of its people and the breath-taking views of its quiet countryside of farmland, lakes, bogs and the occasional low hill. Reachable by road, rail and water, Co Longford is also accessible to those with a love of flying small aircraft. The award winning village of Abbeyshrule in South Longford is home to Abbeyshrule Airfield, the only airfield in the midlands of Ireland and the base for a number of flying schools including Abbeyshrule Microlite Flying School. This airfield  is also the host of the longest running air show in Ireland, attracting large crowds from home and abroad on an annual basis. Those who wish to keep their feet firmly on the ground play on Longfords 18 hole championship golf course which overlooks the county town.   The course attracts regular players and visiting clubs and is considered an ideal base for those with a love of golfing to explore the many  top Irish golf courses of the Lakelands region, all within easy driving distance. Longford also has excellent facilities for  activities such as pitch and putt, archery, go-karting, paintballing, tennis, equestrian trails, and orienteering, as well as indoor pursuits such as swimming and  ten pin bowling. Tourist Trails which criss-cross the county provide memorable days of discovery for drivers, walkers, cyclists and those enjoying the inland waterways of Ireland.  The Royal Canal, Lough Ree, Lough Gowna, the River Shannon, as well as the many smaller lakes and rivers of the county, offer endless opportunity to take part in water sporting activities. Water polo, canoeing and kayaking, white water rafting and water tubing are all enjoyed by visitors to the area. Those with a less energetic holiday in mind can while away the hours canal cruising, boating, coarse and game angling. An eclectic mix of travellers from all walks of life arrive into Longford  and the unique biodiversity of  the county is of particular interest to those with a love of nature. Excellent forest walks and large stretches of bogland, some in relatively pristine condition and distinct to the midlands of Ireland, provide fascinating grounds for exploration, observation and discussion. In addition, Glen Lough bird sanctuary, Fortwilliam Turlough, Lough Kinale, Derragh Lough and Lough Forbes Complex are all  listed by the National Parks and Wildlife Service  as natural heritage areas or special areas of conservation and protection. Longford has several impressive archaeological sites to visit; Corlea Trackway, Portal Dolmens in Aughnacliff and Cleenrath, standing stones near Granard and the highest Norman Motte and Bailey in the country. The county has strong associations with the legendary Queen Maeve who, according to the epic Irish tale, An Táin Bo Cuailgne, overnighted  with her armies in Granard while en route to steal the coveted ‘Brown Bull of Cooley’. It was also in County Longford  that Queen Maeve met her death while bathing on the island of Inis Clothran on Lough Ree. Her nephew, and slayer, Furbaide Ferbend is reputedly buried on Cairn Hill, Longfords highest point. Much more ancient than this tale is the legend of Midhir and Étain, set at the hill of Brí Leith in Ardagh. This story, ‘The Wooing of Étain’ which spans over a thousand years, is a tale of the lives and loves of the beautiful Étain. Recounted in the Yellow Book of Lecan, one of the earliest surviving Irish manuscripts, it predates all the Irish stories of renown.  It is a tale of the ‘Tuatha De Dannan’, the fairy people of Ireland, who resided in the sídhe; portals to the underground world of the fairy people.   It is a tale of transformation, the overcoming of obstacles, rebirth, regeneration and the endless cycle of life and death. It is a tale of love, of magic, myth and mystery which keeps locals and visitors pondering its meanings and searching for signs of the now elusive entrance to the world of the forever young, Tír na Nóg."
  },
  "mayo": {
    "link": "http://www.mayo-ireland.ie/en/about-mayo/about-mayo-overview.html",
    "text": "County Mayo is a region on the west coast of Ireland. Its name comes from the Irish words 'Maigh Eo' meaning 'Plain of the yew trees' and originates from the village of Mayo nowadays known as Mayo Abbey. The total area is 5.586 km2. It belongs to the Province of Connaght. It borders on the north with the Atlantic Ocean, on the south with County Galway, on the east with County Roscommon, while the northeast is adjacent to County Sligo. The population is 130.425 according to the 2016 census. The largest towns in the county are Castlebar (county town) with a population of 10.852, Ballina 11.086, Westport 6063 and Claremorris with 3412. The Mayo coat of arms consists of nine yew trees, a Patriarchal Cross and three Passion Crosses and a ship between waves. The nine yew trees represent the nine historical baronies, four in the northern area (Erris, Burrishoole, Gallon, Tyrawley) and five in the south of the country (Claremorris, Costello, Murrisk, Klimaine and Carra). The Patriarchal Cross (the cross with two bars) symbolizes the Catholic Archdiocese of Tuam, while the three Passion Crosses represent the other three dioceses in Mayo: Achonry, Killala and Galway-Kilmacduagh-Kilfenora. The ship between the waves emphasizes the fact Mayo is a maritime country, while the crown with the rose on top symbolizes the apparition of the Virgin and Saints at Knock on 21st August 1879. The Irish motto completes the coat of arms: 'Dia is Muire Linn', God and Mary be with us."
  },
  "offaly": {
    "link": "https://www.tripsavvy.com/county-offaly-1542108",
    "text": "The Irish name of County Offaly is Contae Uíbh Fhailí, the literal meaning of which is 'The Children of Failge' - referring to the semi-mythological local king Failge Berraide (who reigned around 510). Between 1556 and 1920, Offaly was better known as the 'King's County' - in honour of King Philip II of Spain (husband to English Queen 'Bloody' Mary). The car registration issued in County Offaly has the letters OY on the number plate. The county town of Offaly is Tullamore, other important towns in the county are Banagher, Birr, Clara, and Edenderry. County Offaly measures out at an exact 2,000 square kilometres. The number of inhabitants stands at 76,687, according to the census of 2011. A common nickname for Offaly is 'the Faithful County'. Though Clonmacnoise is never really on the way, a detour to see this monastic site is worth the time and gas. Situated at an ancient crossroads where the Esker Way and the Shannon intersect, Clonmacnoise is not overrun by tourists. Even on weekends in the summer months, it usually is quite peaceful. This and the simply wonderful location make it a worthwhile target for touring vacationers. Getting to Clonmacnoise can be a problem - you will need a good road map and then follow quite small and winding country lanes through Offaly. As the site is next to the Shannon and quite low, you will only spot the towers in the last minute. Pride of place in the heritage town of Birr must go to Birr Castle, still in private hands and opposite a handy, albeit extremely ugly municipal car park. Once you enter the courtyard this ugliness is quickly forgotten. An exhibition tells you about the history of the castle, the landscaped grounds and... astronomy. The 3rd Earl of Rosse was so taken in by stargazing that he not only studied astronomy, but proceeded to build the world's largest telescope in his backyard. The aptly named 'Leviathan' from the 1840s has been restored in recent years and is one of Ireland's most important technical monuments. The Irish Game and Country Fair at Birr Castle is a perfect way to discover life in the Irish countryside (or, at least, the lifestyle promoted for the genteel Irish countryman and -woman.) A great day out anyway. The fair is now an annual part of the County Offaly events calendar and well worth a visit. Actual displays change, but you can always expect living history as well as lifestyle shopping. Offaly style."
  },
  "roscommon": {
    "link": "http://www.irelandwide.com/regional/connaught/county_roscommon/coroscommon_main.htm",
    "text": "One of Ireland's undiscovered counties is that of Roscommon, in the heart of Connaught in the west of Ireland. Covering an area of 984 square miles and with a population of just over 51,800, Roscommon offers peace and tranquillity in an idyllic landscape of lakes, rivers and wooded countryside. The name Roscommon stems from the Irish word 'Ros' meaning a gentle terrain with plenty of trees and 'Conman', the name of the county's famous Irish saint and the first bishop of the See. Bound by the extensive waterways of the River Shannon and Lough Ree to the east, the River Suck in the west and Lough Key in the north, County Roscommon is a haven for lovers of boats, watersports and of course, angling. Cruising on the water in Roscommon is one of the most enjoyable ways to discover this unspoiled pocket of Ireland. Visitors can also discover a rich heritage of early colonization in Roscommon with many burial grounds, megalithic tombs and ring forts. The royal burial site at Rathcroghan was also home to the kings of Connaught and later become home to the high kings of Ireland. Extensive boglands are found in the west of the county providing turf for winter fuel. County Roscommon boasts of magnificent preserved forested land with abundant wildlife open to the public. Lough Key Forest Park near Boyle is 350 hectares of mixed woodland, lakes, islands, medieval priories and a castle. It is one of the most picturesque locations in Ireland. Traditionally the chief industry in County Roscommon has been farming or agricultural related activities. Today farming accounts for 30% of employment in the county. Food manufacturing, bacon production, cannery, dairy food, poultry and other meat products are well represented. Agricultural engineering plants have expanded their output to include commercial and industrial products including those for waste management and building. Tourism is a relatively fledging industry for County Roscommon with great potential for further development. Being located in the centre of Ireland, County Roscommon is easily accessible and is en route to Counties Galway and Mayo to the west. Galway city is only 75 km away. The nearest airports are Knock in County Mayo, Galway Airport and Sligo Airport. County Roscommon is well served by Irish Rail. The Dublin to Sligo link passes through Boyle on the north of the county while the Dublin to Westport-Ballina line serves Roscommon town and Castlerea. Bus Eireann also run an efficient service across the county. Dublin and Dun Laoghaire are the nearest seaports if traveling from the continent."
  },
  "sligo": {
    "link": "http://www.sligoroots.com/about/about-county-sligo/",
    "text": "County Sligo is located on the North West coast of Ireland, on the edge of the Atlantic Ocean. Bordered by three counties, County Sligo lies about 130 miles from Dublin, Ireland’s capital city. County Sligo occupies an area of some 690 square miles and is home to close on 60,000 residents. Sligo City is the principal urban centre. but the county also has a number of  significant towns namely  Tubbercurry, Ballymote, Grange, Collooney and Enniscrone. County Sligo is world renowned for the stunning beauty of its landscape and the warmth of its people. The breathtaking mountains, lakes and beaches offer a range of activities for all tastes – including golf, fishing, horse riding, cycling, walking, sailing, swimming and surfing Visitors to County Sligo can also enjoy a rich concentration of archaeological and burial sites of the megalithic age. Carrowmore is one of the oldest Stone Age cemeteries in Europe, while Knocknarea mountain is home to the tomb of the legendary Queen Meabh. Other evidence of early settlements in County Sligo can also be found on Inishmurray Island and at Drumcliffe. The literary tradition continues to thrive today with the Sligo Arts Festival and a full programme of cultural events throughout the year. Traditional Irish music can also be found in many of Sligo’s charming pubs and taverns."
  },
  "tipperary" : {
    "link": "http://www.irelandwide.com/regional/munster/county_tipperary/index.htm",
    "text": "County Tipperary, the largest inland county, covers and area of 1,647 square miles of some the most fertile and picturesque countryside in Ireland. Scattered with an abundance of important archaeological sites, this historical county is famed for its rich heritage and culture. Fondly famed for its songs and stories, County Tipperary is full of charm and a warmth visitors will not forget. In 1838, the county was divided by Government into two administrative areas - the North Riding and South Riding which are still managed as separate entities. Combined, the population of County Tipperary stands in excess of 130,000. The county name is derived from the Irish 'Tiobraid Arann', the well of Era, referring to the River Ara. The centre of County Tipperary is known as 'the Golden Vale', a rich pastoral stretch of land in the basin of the River Suir, which crosses the county from north to south. Tipperary is bound by mountains to the south and west with a border on Lough Derg in the north thus offering a superb range of outdoor activities for visitors and locals alike. The primary historical site is that of the Rock of Cashel, an imposing Cathedral and round tower encompassing some 2000 years of history, was once an important ecclesiastical centre and home to the Kings of Munster. County Tipperary has a strong sporting history and is home to the Gaelic Games of Hurling, Gaelic Football, Camogie and Handball. County Tipperary is easily accessible from anywhere in Ireland. Main trunk roads pass through the county from Dublin to the south and west of Ireland. The main railway stations are Limerick Junction near the town of Tipperary and Thurles. Bus Eireann operates a regular service across the county. The nearest domestic and European airports are Waterford and Cork, Shannon Airport is the closest international airport. Rosslare in County Wexford serves as the nearest seaport to County Tipperary."
  },
  "waterford" : {
    "link": "https://www.carhire.ie/waterfordbackground.php",
    "text": "Early in Irish history, Waterford seemed poised to become the most important city in the country. This was the site of the first city in all of Ireland, founded in this case by Viking traders in the 9th century. They laid the foundations for a city and built fortification to hold their ground against native Irish tribes. The matter became much more complicated when England’s Henry II crossed the sea and landed at Waterford in the 12th century. At this point, Dublin was well into the mix of Irish cities and was named a ‘royal city’ along with Waterford. During the medieval period, Waterford developed a strong second-city status. The city was referred to as ‘Little Rome’ after the Reformation, due to its strong ties to the papal authorities. To be fair, the Vatican may have been strong, but the Church of England was much closer. When Cromwell’s forces wrought terror through the cities of Ireland, Waterford went under siege. Another wave of prosperity washed over the city in the 1700s. Much of the historic architecture that stands in the city today was built during that time period, including the city hall building. This is also when Waterford first the entered the world stage in terms of crystal production. In those days, Waterford was also known for ship building. In fact, an iron steam ship that was built here in Waterford became the first of its kind ever to sail to a Russian port. It even carried a gift of fine locally produced crystal to be delivered to the Tsar. Waterford doesn’t play nearly as strong a role in Irish politics and identity as it did in medieval times. However, this in no way detracts from the important position that the city held when Ireland was still a hotly sought-after land by invading Vikings, warring Anglo-Normans and distant popes. As such, it has a great deal to offer modern-day visitors eager to learn more about Ireland’s roots as a nation. "
  },
  "wexford": {
    "link": "https://www.wexfordcorp.ie/",
    "text": "Wexford Town is the main settlement in the County of Wexford, Ireland. It’s located on the south-eastern coast of the country. Access to the town is helped a lot by the M11 which runs from the Capital City of Ireland, Dublin. There is also a train service running to Wexford from Dublin. The population of the town is just a little short of 20,000 people, although that statistic comes from a 2011 census, so the population may have risen marginally since then. A lot of residents run businesses that are attractive to visitors of Wexford such as Hotels and Restaurants. The town is positioned to the South of the Wexford Harbour, the River Slaney’s estuary. ‘Wexford’ is of course the town’s official name, but the area also has an Irish name, which is not particularly used by non-local folk. This name is “Loch Garman”, and it stems from the drowning of a man called Garman Garbh, which happened at the mudflats at the beginning of the Slaney River, caused by flood water that came from an enchantress. The loch that resulted from this was therefore called Loch Garman. Wexford was originally established by the Vikings in roughly the year 800AD. Their name for it was Veisafjǫrðr. For approximately 3 centuries Wexford was a Viking settlement which more or less had it’s own independence. Midway through the year 1169, Wexford was taken by force by Dermot MacMurrough, who was the King of Leinster at the time, along with his Norman accomplice Robert Fitz-Stephen. The Nordic population inside of Wexford put up a huge fight against this, after which the Bishop of Ferns convinced the Nordic people to form an agreement with Dermot. Wexford then went on to become a primarily English area right thoughout the mid-centuries. A version of the English language local to the area, called Yola, was the defacto language used in Wexford until the close of the 18th century, and possibly slightly after. In the 1600s Wexford gave a strong voice of acceptance for Confederate Ireland. Several people who were important to the confederate movement resided in the town, and these folk were typically locals or sailors from abroad. They took their boats to the locations of English government ships and robbed them, then gave the goods to the Confederate rulers in Kilkenny. Because of this, Wexford was disassociated with by the English as a part of Cromwell’s defeat of Ireland in the mid 1600s. A lot of Wexford’s population were murdered and a lot of the properties were destroyed. The County of Wexford was heavily involved in the late 1700s movement to try and get rid of British power over the people. The rebels who orchestrated this took charge of Wexford during the conflict, and they inflicted the killings of people loyal to the British within the town. The killings were done with the use of pikes on Wexford bridge. Many of today’s Wexford residents who take an interest in their local history know all about this. The site of Redmond Square, which is located close to the train station, hosts memorials of John Redmond, who was born in 1806 and died in 1865. During his life he was the Liberal Member of Parliament for Wexford. William Archer Redmond, who was the nephew of Redmond, was also later a Member of Parliament in the late 1800’s. Another (and younger) John Redmond, who was the son of William Archer Redmond, was a committed follower of Charles Parnell and he (William) was also the head of the Irish Parliamentary Group up to the point when he passed away in 1918. He is commended in the Redmond family’s vault, which is located at St. John’s Cemetary. In the 1930s Redmond Park was put together as a mark of respect for William Redmond, who was the younger sibling of John. He too was an IPP Member of Parliament and he died in 1917 whilst working for the Irish Division. Wexford is of course coastal and its reputation as an effective seaport took a hit during the 1900s due to the ever altering sands inside the Harbour of Wexford. When the late 1960s came around, locals had decided that it was no longer financially worthwhile to carry on dredging a channel from the entrance to the harbour over to the quays so that they could allow the bigger boats and ships of that time. For this reason the port was shut down. This was a shame at the time because the port was historically crucial for providing jobs to locals. Their main import was coal and their imports were grain and machines. In our current times, the port functions only as a base for fishermen. The framework which formed the face of the quays and was made of wood, were dismantled during the late 20th century in order to turn the quay into an asset of Wexford but also to try and keep its status as an economically valid area. The company that took this on went bust, but even so, the project eventually succeeded. During the early 1900s, a new port was constructed about a dozen miles to the south, at the Rosslare Harbour, which today is called Rosslare Europort. The water is far from shallow there, meaning that currents and tides that cause so many problems at other ports, are rarely able to cause problems. The clear majority of shipping now goes through that port, and this leaves Wexford Port to be used by small-time fishermen and for non-commercial purposes too."
  },
  "wicklow" : {
    "link": "http://www.dublin.info/wicklow/",
    "text": "County Wicklow is the southern neighbour of County Dublin and a major destination for day trips by Dubliners. Both locals and tourists come out here to visit historical sites like Glendalough and Powerscourt. Dubliners also like to go to Brittas Bay for a day by the sea and a barbecue in the sand dunes. The remote valleys and ridges of Wicklow have for centuries been a stronghold of Gaelic clans contesting the English rule over Ireland. County Wicklow was established in 1606 by the English to focus efforts on controlling these local clans. The land for this new county, incidentally the last to be established in Ireland, came from County Dublin and County Carlow. The failed 1798 rebellion took place in the Wicklow Mountains and the first road to cross the mountains was the Military Road built by the English to move troops faster from Dublin to centres of insurgency. You can drive along the Military Road today, travelling through unspoiled wilderness over the Sally Gap pass and enjoy great views over the city of Dublin. Despite its proximity to Dublin, County Wicklow has large unpopulated areas and stretches of unspoiled nature. The Wicklow Mountains National Park is one of the biggest nature reserves in Ireland. Much of the remaining woodland outside the park hides elegant country homes and large estates. There are no larger cities and only few towns in Wicklow. Bray, 20 kilometres South of Dublin and just within Wicklow borders, is the county's biggest conurbation. Glendalough is an early medieval monastery which commandeers a magical location between two mountain lakes in a narrow glacial valley studded with thick pine forests. The Irish name Gleann Dá Loch appropriately means Glen of Two Lakes. Hermit priest St. Kevin founded the monastery in the 7th century and it became an important centre for religious pilgrimage and learning until the complex was destroyed by English troops in 1398. Key parts of the monastery were restored during the 19th century, such as the 30 metres high Round Tower. Walking through the complex, you get a good impression of what the monastery might have looked like in the middle ages. Try to come out here either very early or late in the day, avoiding the crowds at peak times. Glendalough is a big tourist draw and the crowds can seriously put in on you experience of this otherwise serene and peaceful site. There is no direct public transport link from Dublin to Glendalogh but St Kevin's, a local private company, runs a coach service between Dublin and Glendalough. Powerscourt was established by the Normans as a stronghold in the fiercely independent Wicklow Mountains. The castle was extended over the centuries with the biggest makeover taking place during the 18th century, which resulted in the dominance of Palladian architecture you can see in Powerscourt today. The house burnt down in 1974 and has since been painstakingly restored. Powerscourt houses a collection of gift and design shops and a good restaurant and cafe run by Avoca. From the restaurant terrace you can enjoy great views over the formal 18th century gardens and the Sugarloaf mountain in the distance. The lands of the estate also harbour Ireland's highest waterfall, the 121 metres high Powerscourt Waterfall. To visit Powerscourt by public transport, take the Dart to Bray and the 185 bus to Enniskerry. It's a good 15 minutes' walk uphill from picturesque Enniskerry village to the gates of the estate. Alternatively, take the 44C bus directly from Townsend Street in Dublin's city centre to Enniskerry. The Wicklow Mountains are a rugged, sparsely populated mountain range that starts just outside the outskirts of Dublin and runs across County Wicklow into County Wexford. The highest peak in the range is Lugnaquilla with 925 metres. A large part of the area is covered by the Wicklow Mountains National Park. Established in 1991, the National Park is one of the biggest in Ireland and currently covers more than 170 square kilometres. Brittas Bay is one of the most scenic beaches on Ireland's East Coast with its 5 kilometres of golden sands and sweeping dunes. Brittas has won the European Blue Flag for clean beaches five years in a row. There are no cars allowed on the beach. Car parks are located outside the dune belt and you will face a good 10 minutes' uphill walk over the dunes to get to the beach. It's worth the effort. Brittas is a popular destination for daytrips by Dublin city dwellers. Many Dublin families keep mobile homes or more spectacular villas behind the dunes as holiday homes. The Dart local railway service from Dublin services Bray and Greystones in North County Wicklow. Dublin Bus operates several routes to villages and towns on the Northern fringes of the county. Bus Eireann runs regular coach services to all parts of Wicklow. Major tourist attractions like Powerscourt and Glendalogh are also serviced from Dublin by private tour companies, particularly during the summer months."
  },
  "northernIreland" : {
    "link": "http://projectbritain.com/northern_ireland.html",
    "text": "Northern Ireland lies in the northeast of the island of Ireland, covering 5,459 square miles (14,139 km²), about a sixth of the island's total area. Northern Ireland is the second most sparsely populated part of the UK after Scotland, with 317 people per square mile (122 per square kilometre). In 1801 the whole of Ireland became part of the United Kingdom, with the adoption of the name the United Kingdom of Great Britain and Ireland. After years of civil war, Ireland became a republic in 1921. At this time, Britain negotiated with Ireland to keep the six counties in the north-east of Ireland. These six counties now make up what is known as Northern Ireland. The southern part of the island is the Republic of Ireland, or Eire. The Giant's Causeway, situated on the North East coast of Northern Ireland, is an area of about 40,000 interlocking basalt columns, the result of an ancient volcanic eruption. The Northern Ireland Assembly was established as part of the Belfast Agreement (also known as the Good Friday Agreement). The Assembly debates and makes laws, and scrutinises and makes decisions on the work of the Northern Ireland government departments. HMS Titanic ship was built in Belfast, the capital of Northern Ireland."
  }
}





